emacs-config.org
#+TITLE: Emacs Configuration
#+LANGUAGE:  en
#+AUTHOR: Ryan Yanson
#+OPTIONS:   H:3 num:t   toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t
#+DESCRIPTION: My custom emacs configuration
#+KEYWORDS:  My custom emacs configuration
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: 
#+HTML_HEAD: <style type="text/css">body{font-family:"lucida grande",tahoma,verdana,arial,sans-serif;font-size:11px;color:#333}.fbbody a{color:#3b5998;outline-style:none;text-decoration:none;font-size:11px;font-weight:bold;width:100%;height:100%}.fbbody a:hover{text-decoration:underline}table,.fbgreybox{margin:5px;background-color:#f7f7f7;border:1px solid #ccc;color:#333;padding:10px;font-size:13px;font-weight:bold}.fbbluebox,.org-src-container{background-color:#eceff6;border:1px solid #d4dae8;color:#333;padding:10px;font-size:13px;font-weight:bold;word-wrap:break-word;}.fbinfobox{background-color:#fff9d7;border:1px solid #e2c822;color:#333;padding:10px;font-size:13px;font-weight:bold}.tag{background-color:#fff9d7;border:1px solid #e2c822;color:#333;padding:10px;font-size:13px;font-weight:bold}.fberrorbox{background-color:#ffebe8;border:1px solid #dd3c10;color:#333;padding:10px;font-size:13px;font-weight:bold}hr,.fbcontentdivider{margin-top:15px;margin-bottom:15px;width:520px;height:1px;background-color:#d8dfea}.fbtab{padding:8px;background-color:#d8dfea;color:#3b5998;font-weight:bold;float:left;margin-right:4px;text-decoration:none}.fbtab:hover{background-color:#3b5998;color:#fff;cursor:hand}.timestamp{font-weight:bold}ul.org-ul{list-style-type:none;padding:0;margin:0;border:1px solid #d4dae8;font-weight:normal}.timestamp{font-weight:bold;float:right}ul.org-ul li{margin-top:0;margin-bottom:5px}.org-ul li:nth-child(odd){background-color:#d4dae8}.org-ul li:last-child{margin-bottom:0}</style>
------
* Introduction
* Usage
This file can be used to load emacs provided use-package is available prior.  If use package is not
available the sample init in the next section can be used to bootstrap use-package so that loading 
will work.  As long as use-package is in place all package downloads will happen automatically.

* Init
My init file contains the lines below.  It is just enough to bootstrap use-package
and then load this document.

#+begin_src emacs-lisp :tangle no
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Start the server
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(if (eq system-type 'windows-nt)
    (progn
      (require 'server) 
      (server-start)))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Remove unnecessary gui stuff
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  Remove spash screen
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(setq inhibit-splash-screen t)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  Load ITS related settings.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(load "~/emacs/Config/its-config.el" t)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  Bootstrap use-package.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(require 'package)
(setq package-enable-at-startup nil)

(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.org/packages/")))

(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))

(require 'diminish)
(require 'bind-key)

(setq use-package-verbose t)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  Tangle and byte compile the source ORG document if it is newer than the
;;  previously tangled and compiled file.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(let ((src "~/.emacs.d/emacs-config.org")
      (dst "~/.emacs.d/emacs-config.elc"))
  (if (file-newer-than-file-p src dst)
      (add-hook 'after-init-hook (lambda () (org-babel-load-file "~/.emacs.d/emacs-config.org" t)))
    (add-hook 'after-init-hook (lambda () (load-file "~/.emacs.d/emacs-config.elc")))))
#+end_src

* Modeline configuration
The mode-line is configured using the code below.  I like to have a simplified
mode-line so many of the usual things have been removed.

#+begin_src emacs-lisp :tangle yes :exports code
(setq-default mode-line-format
             '("%e"
               mode-line-front-space
               "%b"
               "   "
               mode-line-position
               (vc-mode vc-mode)
               "  "
               mode-line-modes
               "   "
               display-time-string
               "   "
               mode-line-end-spaces))
#+end_src

* Enable functions
Enable editing functions that are disabled by default.

#+begin_src emacs-lisp :tangle yes :exports code
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

(put 'narrow-to-region 'disabled nil) 
(put 'narrow-to-page 'disabled nil) 
(put 'narrow-to-defun 'disabled nil) 

(put 'erase-buffer 'disabled nil)
#+end_src

* Apropos
Make apropos a little more helpful.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq apropos-do-all t)
#+end_src

* Garbage collection
Change garbage collection to only happen every 20 MB.  Originally found on
https://github.com/CQQL/dotfiles/blob/master/src/.emacs.d/lisp/globals.el

#+begin_src emacs-lisp :tangle yes :exports code 
(setq gc-cons-threshold 20000000)
#+end_src

* Scrolling
I dislike the way that Emacs scrolls by default.  I also do not feel like brining
in an extra package for scrolling so this is a compromise.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq scroll-margin 5)
(setq scroll-preserve-screen-position 1)
#+end_src

* Recenter positions
Like scrolling the default recenter command has a strange order that recenters 
happen.  This was a very nice pickup from Abo Abo.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq recenter-positions '(top middle bottom))
#+end_src

* Which function
Show the current function name in the status line.

#+begin_src emacs-lisp :tangle yes :exports code 
(which-function-mode 1)
#+end_src

* Overwrite region
With this option enabled a highlighted region will be overwritten if one is active 
and I start typing.

#+begin_src emacs-lisp :tangle yes :exports code 
(delete-selection-mode t) 
#+end_src

* Killing buffer in server mode
This removes the message that is displayed when killing a buffer in server mode.

#+begin_src emacs-lisp :tangle yes :exports code 
(remove-hook 'kill-buffer-query-functions 'server-kill-buffer-query-function)
#+end_src

* File dialog
Disable the file dialog.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq use-file-dialog nil)
#+end_src

* Y-N prompts
Use 'Y' and 'N' instead of yes and no for prompts.

#+begin_src emacs-lisp :tangle yes :exports code 
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

* Transient mark mode
Enable transient mark mode so that highlighting regions activates special behaviors.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq transient-mark-mode t)
#+end_src

* Delete selection
Set this to enable the deletion of regions.

#+begin_src emacs-lisp :tangle yes :exports code 
(delete-selection-mode 1)
#+end_src

* Show parentheses
Enable subtle highlighting of matching parentheses.

#+begin_src emacs-lisp :tangle yes :exports code 
(show-paren-mode +1)
(setq show-paren-style 'parenthesis)
#+end_src

* Blinking cursor
Disable the annoying blinking cursor.

#+begin_src emacs-lisp :tangle yes :exports code 
(blink-cursor-mode 0) 
#+end_src

* Font
Set the default font to Consolas when on a Windows machine.

#+begin_src emacs-lisp :tangle yes :exports code 
(if (eq system-type 'windows-nt)
    (set-face-attribute 'default nil :font "Consolas-11:antialias=subpixel"))
#+end_src

* Path
Add some paths to the path when on Windows machines.  When at work I do not want
to update the path so this is a work around.

#+begin_src emacs-lisp :tangle yes :exports code 
(if (eq system-type 'windows-nt)
    (setq exec-path
          (append exec-path
                  '("~/emacs/Graphviz/bin"
                    "~/emacs/Hunspell/bin/"
                    "~/emacs/Gnutls/bin"
                    "~/emacs/Leiningen"
                    "~/Git/bin"
                    "C:/IBM/SDP"))))
#+end_src

* GraphViz
Set an environment variable for the GraphViz program.  Simply setting the path
does not work as expected.

#+begin_src emacs-lisp :tangle yes :exports code 
(if (eq system-type 'windows-nt)
    (setenv "GRAPHVIZ_DOT" "~/emacs/Graphviz/bin/dot.exe"))
#+end_src

* GnuTLS
Set the path to the trustfiles used by GnuTLS after the gnutls module is loaded.
Setting it prior to load does not work properly.  Also setting this path does 
not work unless the full path is provided.

#+begin_src emacs-lisp :tangle yes :exports code 
(if (eq system-type 'windows-nt)
    (eval-after-load "gnutls" 
      '(progn 
         (setq gnutls-trustfiles '("h:/emacs/cacert.pem")))))
#+end_src

* Working with long lines
This setting is used to truncate lines instead of wrapping them.  I like the 
idea of visual-line-mode but never got used to it.

#+begin_src emacs-lisp :tangle yes :exports code 
;; (set-default 'truncate-lines t)
(global-visual-line-mode)
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
#+end_src

* Large files
I work with log files quite often and sometimes they are very large.  The 
setting below will allow files to be opened without warnings until they are
over 100MB in size.

#+begin_src emacs-lisp :tangle yes :exports code 
(set-default 'large-file-warning-threshold 1000000000)
#+end_src

* Backup files
Set values so that backup files are not littering my directories.  The BACKUP
folder will be ignored by git.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq backup-directory-alist
      `((".*" . "~/.emacs.d/BACKUP")))
(setq auto-save-file-name-transforms
      `((".*" , "~/.emacs.d/BACKUP" t)))
#+end_src

* Tabs
Use four spaces in place of tab characters.  Things get weird when programs 
don't treat tabs the same.

#+begin_src emacs-lisp :tangle yes :exports code 
(setq-default indent-tabs-mode nil)
(setq tab-width 4)
#+end_src

* File refreshing
Automatically revert the buffer to the contents of the file on the disk if it has 
changed.

#+begin_src emacs-lisp :tangle yes :exports code 
(global-auto-revert-mode t)
#+end_src

* Navigation
I am starting to get used to idea of setting mark and moving back and forth.  This
key binding was taken from Sacha Chua.  

#+begin_src emacs-lisp :tangle yes :exports code 
(bind-key "C-x p" 'pop-to-mark-command)
(setq set-mark-command-repeat-pop t)
#+end_src

* Spelling
** Configuration
I am very poor at spelling.  The following will enable flyspell and use Hunspell
as the background spelling process.  The dictionary and Hunspell are installed 
below my home directory on my Windows machines.

#+begin_src emacs-lisp :tangle yes :exports code  
(setq ispell-personal-dictionary "~/emacs/Config/en_US_personal")
(setq ispell-silently-savep t)
(setq ispell-quietly t)
#+end_src

Flyspell will need a couple environment variables set to know what the default
dictionary is and its path.  This may be done in Linux but is not done properly
in Windows, so set it up here.

#+begin_src emacs-lisp :tangle yes :exports code  
(if (eq system-type 'windows-nt)
    (progn
      (setenv "DICTIONARY" "en_US")
      (setenv "DICPATH" "~/emacs/Hunspell/share/hunspell"))
  (progn
    (setenv "DICTIONARY" "en US")
    (setenv "DICTPATH" "/usr/share/hunspell")))
#+end_src

Enable spelling for comments in programming modes too.

#+begin_src emacs-lisp :tangle yes :exports code  
(add-hook 'java-mode-hook
          (lambda ()
            (flyspell-prog-mode)))
            
(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (flyspell-prog-mode)))
#+end_src

This was a suggestion from [[http://www.emacswiki.org/emacs/FlySpell]] as a way to 
speed up flyspell by not writing messages.

#+begin_src emacs-lisp :tangle yes :exports code   
(setq flyspell-issue-message-flag nil)
#+end_src

