emacs-config.el

(setq-default mode-line-format
             '("%e"
               mode-line-front-space
               "%b"
               "   "
               mode-line-position
               (vc-mode vc-mode)
               "  "
               mode-line-modes
               "   "
               display-time-string
               "   "
               mode-line-end-spaces))

(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

(put 'narrow-to-region 'disabled nil) 
(put 'narrow-to-page 'disabled nil) 
(put 'narrow-to-defun 'disabled nil) 

(put 'erase-buffer 'disabled nil)

(setq apropos-do-all t)

(setq gc-cons-threshold 20000000)

(setq scroll-margin 5)
(setq scroll-preserve-screen-position 1)

(setq recenter-positions '(top middle bottom))

(which-function-mode 1)

(delete-selection-mode t)

(remove-hook 'kill-buffer-query-functions 'server-kill-buffer-query-function)

(setq use-file-dialog nil)

(fset 'yes-or-no-p 'y-or-n-p)

(setq transient-mark-mode t)

(delete-selection-mode 1)

(show-paren-mode +1)
(setq show-paren-style 'parenthesis)

(blink-cursor-mode 0)

(if (eq system-type 'windows-nt)
    (set-face-attribute 'default nil :font "Consolas-11:antialias=subpixel"))

(if (eq system-type 'windows-nt)
    (setq exec-path
          (append exec-path
                  '("~/emacs/Graphviz/bin"
                    "~/emacs/Hunspell/bin/"
                    "~/emacs/Gnutls/bin"
                    "~/emacs/Leiningen"
                    "~/Git/bin"
                    "C:/IBM/SDP"))))

(if (eq system-type 'windows-nt)
    (setenv "GRAPHVIZ_DOT" "~/emacs/Graphviz/bin/dot.exe"))

(if (eq system-type 'windows-nt)
    (eval-after-load "gnutls" 
      '(progn 
         (setq gnutls-trustfiles '("h:/emacs/cacert.pem")))))

;; (set-default 'truncate-lines t)
(global-visual-line-mode)
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))

(set-default 'large-file-warning-threshold 1000000000)

(setq backup-directory-alist
      `((".*" . "~/.emacs.d/BACKUP")))
(setq auto-save-file-name-transforms
      `((".*" , "~/.emacs.d/BACKUP" t)))

(setq-default indent-tabs-mode nil)
(setq tab-width 4)

(global-auto-revert-mode t)

(bind-key "C-x p" 'pop-to-mark-command)
(setq set-mark-command-repeat-pop t)

(setq ispell-personal-dictionary "~/emacs/Config/en_US_personal")
(setq ispell-silently-savep t)
(setq ispell-quietly t)

(if (eq system-type 'windows-nt)
    (progn
      (setenv "DICTIONARY" "en_US")
      (setenv "DICPATH" "~/emacs/Hunspell/share/hunspell")))

(add-hook 'java-mode-hook
          (lambda ()
            (flyspell-prog-mode)))
            
(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (flyspell-prog-mode)))

(setq flyspell-issue-message-flag nil)

(global-set-key (kbd "<f1>") 'ry/flyspell-check-previous-highlighted-word)
(global-set-key (kbd "<f2>") 'flyspell-correct-word-before-point)
(global-set-key (kbd "<f3>") 'ry/flyspell-check-next-highlighted-word)
