emacs-config.org
** Key bindings

#+begin_src emacs-lisp :tangle yes :exports code 
(global-set-key (kbd "<f1>") 'ry/flyspell-check-previous-highlighted-word)
(global-set-key (kbd "<f2>") 'flyspell-correct-word-before-point)
(global-set-key (kbd "<f3>") 'ry/flyspell-check-next-highlighted-word)
(global-set-key (kbd "<f4>") 'ispell-buffer)
#+end_src

** Functions
This function was taken from http://www.emacswiki.org/emacs/FlySpell.  It will 
enable the use of a popup for flyspell instead of it's normal mode of operation.
Company uses a popup so why not have a similar behavior for Flyspell.  This 
could be annoying if checking a whole buffer but I usually do not check a whole
buffer at once.

#+begin_src emacs-lisp :tangle yes :exports code 
(defun flyspell-emacs-popup-textual (event poss word)
  "A textual flyspell popup menu."
  (require 'popup)
  (let* ((corrects (if flyspell-sort-corrections
                       (sort (car (cdr (cdr poss))) 'string<)
                     (car (cdr (cdr poss)))))
         (cor-menu (if (consp corrects)
                       (mapcar (lambda (correct)
                                 (list correct correct))
                               corrects)
                     '()))
         (affix (car (cdr (cdr (cdr poss)))))
         show-affix-info
         (base-menu  (let ((save (if (and (consp affix) show-affix-info)
                                     (list
                                      (list (concat "Save affix: " (car affix))
                                            'save)
                                      '("Accept (session)" session)
                                      '("Accept (buffer)" buffer))
                                   '(("Save word" save)
                                     ("Accept (session)" session)
                                     ("Accept (buffer)" buffer)))))
                       (if (consp cor-menu)
                           (append cor-menu (cons "" save))
                         save)))
         (menu (mapcar
                (lambda (arg) (if (consp arg) (car arg) arg))
                base-menu)))
    (cadr (assoc (popup-menu* menu :scroll-bar t) base-menu))))
#+end_src

Add a hook for the function defined above using popups for spell checking.

#+begin_src emacs-lisp :tangle yes :exports code 
(eval-after-load "flyspell"
  '(progn
     (fset 'flyspell-emacs-popup 'flyspell-emacs-popup-textual)))
#+end_src

Function to check the next highlighted word.

#+begin_src emacs-lisp :tangle yes :exports code 
(defun ry/flyspell-check-next-highlighted-word ()
  "Custom function to spell check next highlighted word"
  (interactive)
  (flyspell-goto-next-error)
  (flyspell-correct-word-before-point))
#+end_src

This is a slightly modified version of function with the same name from Flyspell.
It uses flyspell-correct-word-before-point instead of ispell-word so that the
popup defined above will be used for corrections.

#+begin_src emacs-lisp :tangle yes :exports code 
(defun ry/flyspell-check-previous-highlighted-word (&optional arg)
  "Correct the closer misspelled word.
This function scans a mis-spelled word before the cursor. If it finds one
it proposes replacement for that word. With prefix arg, count that many
misspelled words backwards."
  (interactive)
  (let ((pos1 (point))
	(pos  (point))
	(arg  (if (or (not (numberp arg)) (< arg 1)) 1 arg))
	ov ovs)
    (if (catch 'exit
	  (while (and (setq pos (previous-overlay-change pos))
		      (not (= pos pos1)))
	    (setq pos1 pos)
	    (if (> pos (point-min))
		(progn
		  (setq ovs (overlays-at (1- pos)))
		  (while (consp ovs)
		    (setq ov (car ovs))
		    (setq ovs (cdr ovs))
		    (if (and (flyspell-overlay-p ov)
			     (= 0 (setq arg (1- arg))))
			(throw 'exit t)))))))
	(save-excursion
	  (goto-char pos)
	  ;; (ispell-word)
      (flyspell-correct-word-before-point)
	  (setq flyspell-word-cache-word nil) ;; Force flyspell-word re-check
	  (flyspell-word))
      (error "No word to correct before point"))))
#+end_src

* Key bindings
** Alter return key behavior
This changes the way the return key behaves.  When return is pressed it will
insert a newline and also indent the next line.  Good for programming.

#+begin_src emacs-lisp :tangle yes :exports code 
(define-key global-map (kbd "RET") 'newline-and-indent)
#+end_src

** Change window size

#+begin_src emacs-lisp :tangle yes :exports code 
(global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>") 'shrink-window)
(global-set-key (kbd "S-C-<up>") 'enlarge-window)
#+end_src


#+begin_src emacs-lisp :tangle yes :exports code
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  Key bindingd for custom functions.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(global-set-key (kbd "C-x r M-w") 'my-copy-rectangle)
(global-set-key (kbd "C-x r C-y") 'yank-replace-rectangle)
(global-set-key (kbd "<f12>") 'ry/open-temp-buffer)
#+end_src


#+begin_src emacs-lisp :tangle yes :exports code
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  I dont use tags so this was poached from those keys.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(global-set-key (kbd "M-.") 'find-function-at-point)
#+end_src

* Browsing
** Configuration
I mainly use Internet Explorer when on Windows machines so browse the current URL using it.
#+begin_src emacs-lisp :tangle yes :exports code
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program (if (eq system-type 'windows-nt)
                                     "C:/Program Files/Internet Explorer/iexplore.exe"))
#+end_src

** Key binding
#+begin_src emacs-lisp :tangle yes :exports code
(global-set-key (kbd "C-c B") 'browse-url-at-point)
#+end_src

** Buffer management
I only kill the current buffer most of the time.  The binding below is used so
that I do not need to select which buffer to kill.  If I need to kill a bunch of
buffers or one that is not the current one I will use helm.

#+begin_src emacs-lisp :tangle yes :exports code
(global-set-key (kbd "C-x k") 'kill-this-buffer)
#+end_src

