emacs-config.org
** Functions
Custom function for opening DB2 database connections.  This may not be the best 
way to achieve multiple database connections at once as the SQLi hook is not being
invoked but I do not have enough knowledge of sql.el to find the solution.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/sql-open-database (database username password)
  "Open a SQLI process and name the SQL statement window with the name provided."
  (interactive (list
                (read-string "Database: ")
                (read-string "Username: ")
                (read-passwd "Password: ")))
  (switch-to-buffer "*DB_HELPER*")
  (god-local-mode)
  (insert-file-contents "H:/emacs/Config/DB_INFO.TXT")
  (setq sql-set-product "db2")
  
  (sql-db2 (upcase database))
  (sql-rename-buffer (upcase database))
  (setq sql-buffer (current-buffer))
  (sql-send-string (concat "CONNECT TO " database " USER " username " USING " password ";"))
  
  ;;  These will be used later by midnight mode.
  (set (make-local-variable 'database-name) (upcase database))
  (set (make-local-variable 'database-conn-p) t)
  (add-to-list 'db-buffers-list (current-buffer))

  (other-window 1)
  (switch-to-buffer (concat "*DB:" (upcase database) "*"))
  (sql-mode)
  (sql-set-product "db2")
  (setq sql-buffer (concat "*SQL: " (upcase database) "*"))
  (auto-complete-mode))
#+end_src

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/sql-reopen-database (username password)
  "Reconnect to the database that the current buffer was connected to."
  (interactive (list       
                (read-string "Username: ")
                (read-passwd "Password: ")))

  ;;  TODO : Need to check to make sure the current buffer is a DB buffer.

  (sql-send-string (concat "CONNECT TO " database-name " USER " username " USING " password ";"))
  
  (setq database-conn-p t))
#+end_src

This function will be used as part of a run-at-time function.  It will look at the list of known
DB2 buffers and close the related connection if it sees that the connection is still open.  There
is a hole if the connection in established outside of the normal method used by me.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/sql-connection-cleanup ()
  (interactive)
  "This function will look for open database connections
and disconnect them.  It is assumed that a connection is
only opened by ry/sql-open-database."
  (let ((tmp-list db-buffers-list))
    (dolist (db-buffer tmp-list)
      (if (buffer-live-p db-buffer)
        (with-current-buffer db-buffer 
          (cond ((and (get-buffer-process db-buffer) database-conn-p)
                 (message "Old connection to %s found." database-name)
                 (sql-send-string (concat "DISCONNECT " database-name ";"))
                 (setq database-conn-p nil))
                ((not database-conn-p)
                 (message "Skipping %s as it is not connected." database-name))
               (t (message "Default condition met!"))))
        (progn
          (message "Buffer no longer exists, removing %s." db-buffer)
          (setq db-buffers-list (delete db-buffer db-buffers-list)))))))
#+end_src

Custom function for connecting to a database.  This is no longer in use as I will
use the function above instead.  

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/sql-connect (database username password)
  "Custom SQL connect"
  (interactive (list
                (read-string "Database: ")
                (read-string "Username: ")
                (read-passwd "Password: ")))
  (sql-send-string (concat "CONNECT TO " database " USER " username " USING " password ";")))
#+end_src

The method below was created because I have a tendency to forget to put a restriction
on the number of rows returned by my queries.  It needs some serious TLC to get it 
working correctly.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/sql-send-paragraph ()
  "Add FETCH FIRST clause to the SQL statement prior to sending"
  (interactive)
  (let ((start (save-excursion
                 (backward-paragraph)
                 (point)))
        (end (save-excursion
               (forward-paragraph)
               (point))))
    (save-restriction
      (narrow-to-region start end)
      (if (not (search-forward-regexp "select" nil t))
          (if (not (search-forward-regexp "fetch" nil t))
              (sql-send-string (buffer-substring-no-properties start end))
            (sql-send-string (concat (buffer-substring-no-properties start (1- end)) " FETCH FIRST 50 ROWS ONLY WITH UR;")))
        (sql-send-string (buffer-substring-no-properties start end))))))
#+end_src

The function below is used quite often.  It is not the prettiest but it gets the
job done.  It will wrap the current SQL statement in an EXPORT prior to sending.  
This is helpful when I want to see a large XML document or I want to retrieve a
row that exceeds the maximum number of characters that the DB2 CLP will return.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/sql-send-export-paragraph ()
  "Prefix the current paragraph with an EXPORT command and 
send the paragraph to the SQL process."
  (interactive)
  (let ((start (save-excursion
                 (backward-paragraph)
                 (point)))
        (end (save-excursion
               (forward-paragraph)
               (point)))
        (temp-file
         (make-temp-file "DB2-EXPORT-" nil)))
    (sql-send-string (concat "EXPORT TO " temp-file " OF DEL MODIFIED BY COLDEL0x09 " (buffer-substring-no-properties start end)))
    (switch-to-buffer "*EXPORT*")
    (sleep-for 1)
    (insert-file-contents-literally (concat temp-file ".001.xml"))
    (goto-char (point-min))
    (while (re-search-forward "<\\?xml version=\"1.0\" encoding=\"UTF-8\" \\?>" nil t)
      (replace-match "\n  <?xml version=\"1.0\" encoding=\"UTF-8\" ?>" nil nil))
    (goto-char (point-min))
    (kill-line)
    (goto-longest-line (point-min) (point-max))
    (let ((max-length (- (line-end-position) (line-beginning-position))))
      (goto-char (point-min))
      (setq more-lines t)
      (while more-lines
     	(setq cur-length (- (line-end-position) (line-beginning-position)))
     	(if (< cur-length max-length)
     	    (progn 
     	      (goto-char (line-end-position))
     	      (insert-char 32 (- max-length cur-length))))
     	(setq more-lines (= 0 (forward-line 1)))))
    (kill-rectangle (point-min) (point-max))
    (erase-buffer)
    (insert-file-contents-literally temp-file)
    (while (re-search-forward "\"<XDS\.\*\$" nil t)
      (replace-match "" nil nil))
    (goto-char (point-min))
    (while (re-search-forward "\"" nil t)
      (replace-match "" nil nil))
    (goto-char (point-min))
    (goto-char (line-end-position))
    (yank-rectangle)
    (god-local-mode 1)))
#+end_src

#+begin_src emacs-lisp :tangle yes :exports code
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  Taken from Prelude.  Make the point move to the beginning of the line in the
;;  same way Eclipse does.  Really move back-and-forth between the hard
;;  beginning of the line and the first non-space character.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun prelude-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first. If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))
#+end_src

* XML
** Key bindings
See the Hydra configuration for the key bindings for XML.

| Key     | Command                 |
|---------+-------------------------|
| C-c x f | Pretty-print XML region |
| C-c x l | Compact XML region      |
| C-c x w | Get current xpath       |
| C-c x x | Run xquery on buffer    |
| C-c x X | Run xquery on region    |

