emacs-config.org
** Functions
I am a Java programmer so I created my own utility for formatting XML documents.  The
listing is below.  Basically it accepts the XML document to be formatted and an 
optional argument to indicate if you want the compact formatting or pretty print.
#+begin_src java :tangle no
package com.brookwood.util;

import java.io.IOException;
import java.io.StringReader;
import java.io.StringWriter;
import java.util.Scanner;

import javax.xml.parsers.DocumentBuilder;
import javax.xml.parsers.DocumentBuilderFactory;
import javax.xml.parsers.ParserConfigurationException;

import org.w3c.dom.DOMConfiguration;
import org.w3c.dom.DOMImplementation;
import org.w3c.dom.Document;
import org.w3c.dom.ls.DOMImplementationLS;
import org.w3c.dom.ls.LSOutput;
import org.w3c.dom.ls.LSSerializer;
import org.xml.sax.InputSource;
import org.xml.sax.SAXException;

/*******************************************************************************
 * This class is used to format an XML document.  If the document is to be 
 * "pretty" printed the "--pretty" parameter should be passed before the document
 * to be formatted.  If the pretty flag is not set the XML will be formatted to
 * be on a single line.
 * 
 * @author Ryan Yanson
 *
 ******************************************************************************/
public class XMLFormatter {

	/***************************************************************************
	 * Main entry point for program.
	 * 
	 * @param	args The command line arguments.
	 **************************************************************************/
	public static void main(String[] args) {
		(new XMLFormatter()).run(args);
	}

	/***************************************************************************
	 * Format the XML document passed.  If the first argument is "--pretty" then
	 * format the document for printing, else format it on a single line.
	 * 
	 * @param	args The arguments passed from the command line.
	 **************************************************************************/
	private void run(String[] args) {
		Boolean doIndent = false;
		
		if (args.length >= 1) {
			doIndent = args[0].equalsIgnoreCase("--pretty") ? true : false;
		}
		
		Scanner sc = new Scanner(System.in);
		StringBuilder xml = new StringBuilder();
		
		while (sc.hasNextLine()) {
			String line = sc.nextLine();
			
			//  Remove spaces between tags.
			line = line.replaceAll(">\\s+<", "><");
			line = line.replaceAll("^\\s+<", "<");
			
			xml.append(line);
		}
		
		sc.close();
		
		System.out.print(serializeXML(createDOM(xml.toString()), doIndent));
		System.exit(0);
	}
	
	/***************************************************************************
	 * Create a W3C DOM object.
	 * 
	 * @param cissEvent The CISS event in XML format.
	 * @return a DOM object.
	 * @throws IOException
	 * @throws SAXException
	 **************************************************************************/
	public Document createDOM(String xmlString) {
		try {
			InputSource source = new InputSource(new StringReader(xmlString));
			
			DocumentBuilder builder = DocumentBuilderFactory.newInstance().newDocumentBuilder();
			return builder.parse(source);
		} catch (SAXException e) {
			System.err.println("SAXException while processing XML string : " + e.getMessage());
			System.exit(1);
		} catch (IOException e) {
			System.err.println("IOException while processing XML string : " + e.getMessage());
			System.exit(1);
		} catch (ParserConfigurationException e) {
			System.err.println("ParserConfigurationException while processing XML string : " + e.getMessage());
			System.exit(1);
		}
		
		return null;
	}
	
	/***************************************************************************
	 * Serialize an XML document for printing or onto a single line.
	 * 
	 * @param	document The document to format.
	 * @param	doIndent A Boolean indicating if pretty printing should be used.
	 * @return	The serialized XML document.
	 **************************************************************************/
	public String serializeXML(Document document, Boolean doIndent) {
		DOMImplementation domImplementation = document.getImplementation();
		
		if (domImplementation.hasFeature("LS", "3.0") && domImplementation.hasFeature("Core", "2.0")) {
			DOMImplementationLS domImplementationLS = (DOMImplementationLS) domImplementation.getFeature("LS", "3.0");
			LSSerializer lsSerializer = domImplementationLS.createLSSerializer();
			lsSerializer.setNewLine("\n");
			
			DOMConfiguration domConfiguration = lsSerializer.getDomConfig();
			
			if (domConfiguration.canSetParameter("format-pretty-print", doIndent)) {
				lsSerializer.getDomConfig().setParameter("format-pretty-print", doIndent);
				
				LSOutput lsOutput = domImplementationLS.createLSOutput();
				lsOutput.setEncoding("UTF-8");
				
				StringWriter stringWriter = new StringWriter();

				lsOutput.setCharacterStream(stringWriter);
				lsSerializer.write(document, lsOutput);
				
				return stringWriter.toString();
			} else {
				throw new RuntimeException("DOMConfiguration 'format-pretty-print' parameter isn't settable.");
			}
		} else {
			throw new RuntimeException("DOM 3.0 LS and/or DOM 2.0 Core not supported.");
		}
	}
	
}
#+end_src

Pretty-print the selected region using the Java utility defined above.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/xml-format (beg end)
  "Call an external Java program to format the current region
as an XML document.  Region needs to contain a valid XML document."
  (interactive "*r")
  (save-excursion
    (shell-command-on-region beg end "java -jar H:/emacs/Java/XMLFormatter.jar --pretty" (current-buffer) t)))
#+end_src

Compact the XML document in the active region using the Java utility defined above.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/xml-linearlize (beg end)
  "Call an external Java program to linearlize the current region.  
Region needs to contain a valid XML document."
  (interactive "*r")
  (save-excursion
    (shell-command-on-region beg end "java -jar H:/emacs/Java/XMLFormatter.jar " (current-buffer) t)))
#+end_src

I work with a lot of XML documents.  Most of the time I can just look at the document
and see what I need.  Occasional it can be helpful to write an Xquery to explore the
document.  The code below is a modified version of the functions provided on
http://donnieknows.com/blog/hacking-xquery-emacs-berkeley-db-xml.  While the article 
uses Berkley DB XML I opted to use Saxon.  Saxon is easy to obtain and the installation
is simply unzipping a file and placing a JAR where I want.  This works well on work
machines.

An additional function was also created for performing an Xquery using the entire
buffer instead of an active region.  I find it annoying to have to select things when
I typically write the Xquery as if the buffer was the whole document.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/xquery ()
  "Perform Xquery using Saxon with the current buffer."
  (interactive "")
  (let ((beg (point-min))
        (end (point-max)))
    (ry/xquery-with-region beg end)))

(defun ry/xquery-with-region (beg end)
  "Perform Xquery using Saxon with the current region."
  (interactive "*r")
  (let ((newbuffer nil)
        (buffer (get-buffer "xquery-result"))
        (xquery (buffer-substring beg end)))
    (setq xquery-result
          (cond
           ((buffer-live-p buffer) buffer)
           (t (setq newbuffer t) (generate-new-buffer "xquery-result"))))
    (with-current-buffer xquery-result
      (with-timeout
          (10 (insert "Gave up because query was taking too long."))
        (erase-buffer)
        (insert (ry/perform-xquery xquery t)))
      (nxml-mode)
      (goto-char (point-min)))
    (switch-to-buffer-other-window xquery-result)
    (other-window -1)))

(defun ry/perform-xquery (xquery &optional timed)
  "Perform the selected Xquery using Saxon."
  (setq file (make-temp-file "elisp-dbxml-"))
  (write-region xquery nil file)
  (setq result (shell-command-to-string
                (concat "java -cp H:/emacs/Java/saxon9he.jar net.sf.saxon.Query -q:\"" file "\" !indent=yes\n")))
  (delete-file file)
  (concat "" result))
#+end_src

This function is a modified version of the function found at 
http://www.emacswiki.org/emacs/NxmlMode#toc11.  In addition to displaying the
current xpath in the echo area it will be copied to the clipboard.  This has
proven to be useful many times when someone asks me for the xpaths for all tags
in a document.  It can be added to a macro to generate the list automatically.

#+begin_src emacs-lisp :tangle yes :exports code
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  The function below is a modified version of a function found at:
;;  http://www.emacswiki.org/emacs/NxmlMode#toc11.  In additional to displaying
;;  the current XPATH in the echo area it will be copied to the clipboard.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun ry/xml-where ()
  "Display the hierarchy of XML elements the point is on as a path."
  (interactive)
  (let ((path nil))
    (save-excursion
      (save-restriction
        (widen)
        (while (and (< (point-min) (point)) ;; Doesn't error if point is at beginning of buffer
                    (condition-case nil
                        (progn
                          (nxml-backward-up-element) ; always returns nil
                          t)
                      (error nil)))
          (setq path (cons (xmltok-start-tag-local-name) path)))
        (kill-new (format "/%s" (mapconcat 'identity path "/")))
        (message "XPath copied: 「%s」" (mapconcat 'identity path "/"))))))
#+end_src
* Buffer management
** Key bindings
#+begin_src emacs-lisp :tangle yes :exports code
(global-set-key (kbd "C-x 2") 'sacha/vsplit-last-buffer)
(global-set-key (kbd "C-x 3") 'sacha/hsplit-last-buffer)
(global-set-key (kbd "C-x k") 'kill-this-buffer)
#+end_src

