emacs-config.org
** Functions
Enable god-mode prior to switching buffers.  This is done as I am trying to use
god-mode as a poor-mans evil mode and constantly forget to switch back into 
god-mode.  It would probably be better to force myself to do the switching but
I cannot get it.
#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/switch-buffer ()
  "Function to switch the current buffer to God-mode
 prior to switching buffers."
  (interactive)
  (god-local-mode 1)
  (helm-mini))
#+end_src

Two handy little functions courtesy of Sacha Chua, http://pages.sachachua.com/.emacs.d/Sacha.html.

#+begin_src emacs-lisp :tangle yes :exports code
(defun sacha/vsplit-last-buffer (prefix)
  "Split the window vertically and display the previous buffer."
  (interactive "p")
  (split-window-vertically)
  (other-window 1 nil)
  (unless prefix
    (switch-to-next-buffer)))

(defun sacha/hsplit-last-buffer (prefix)
  "Split the window horizontally and display the previous buffer."
  (interactive "p")
  (split-window-horizontally)
  (other-window 1 nil)
  (unless prefix (switch-to-next-buffer)))
#+end_src

I don't use this function but am leaving it in case I do find a need for it.  Taken
from http://emacsredux.com/blog/2013/03/30/kill-other-buffers/. 

#+begin_src emacs-lisp :tangle yes :exports code
(defun kill-other-buffers ()
  "Kill all buffers but the current one.
Don't mess with special buffers."
  (interactive)
  (dolist (buffer (buffer-list))
    (unless (or (eql buffer (current-buffer)) (not (buffer-file-name buffer)))
      (kill-buffer buffer))))
#+end_src

When I am working it is rare that I will kill a buffer other then the currently 
active one.  This function will kill the current buffer without prompting me.  
It was found at http://www.masteringemacs.org/articles/2014/02/28/my-emacs-keybindings/

#+begin_src emacs-lisp :tangle yes :exports code
(defun kill-this-buffer () 
  "Kill the current buffer without prompting."  
  (interactive) 
  (kill-buffer (current-buffer)))
#+end_src
   
* Narrow and widen
This function narrows and widens intelligently.  It was found at
https://github.com/mwfogleman/config/blob/master/home/.emacs.d/michael.org.

#+begin_src emacs-lisp :tangle yes :exports code
(defun narrow-or-widen-dwim (p)
  "If the buffer is narrowed, it widens. Otherwise, it narrows
intelligently.  Intelligently means: region, org-src-block,
org-subtree, or defun, whichever applies first.  Narrowing to
org-src-block actually calls `org-edit-src-code'.

With prefix P, don't widen, just narrow even if buffer is already
narrowed."
  (interactive "P")
  (declare (interactive-only))
  (cond ((and (buffer-narrowed-p) (not p)) (widen))
        ((and (boundp 'org-src-mode) org-src-mode (not p))
         (org-edit-src-exit))
        ((region-active-p)
         (narrow-to-region (region-beginning) (region-end)))
        ((derived-mode-p 'org-mode)
         (cond ((ignore-errors (org-edit-src-code))
                (delete-other-windows))
               ((org-at-block-p)
                (org-narrow-to-block))
               (t (org-narrow-to-subtree))))
        ((derived-mode-p 'prog-mode) (narrow-to-defun))
        (t (error "Please select a region to narrow to"))))
#+end_src

* Current file path
This little function has proven to be very helpful.  It's not used often but when
I need the current path it makes it easy to get it.  It was originally found in 
Xah Lee's site.

#+begin_src emacs-lisp :tangle yes :exports code
(defun xah/copy-file-path (&optional φdir-path-only-p)
  "Copy the current buffer's file path or dired path to `kill-ring'.
If `universal-argument' is called, copy only the dir path.
Version 2015-01-14
URL `http://ergoemacs.org/emacs/emacs_copy_file_path.html'"
  (interactive "P")
  (let ((fPath
         (if (equal major-mode 'dired-mode)
             default-directory
           (buffer-file-name))))
    (kill-new
     (if (equal φdir-path-only-p nil)
         fPath
       (file-name-directory fPath)))
    (message "File path copied: 「%s」" fPath)))
#+end_src

* Launching Windows programs
The following functions were created as an easy way to launch a couple Windows
programs.  I usually forget they are in here though.

#+begin_src emacs-lisp :tangle yes :exports code
(defun ry/launch-windows-explorer ()
  "Open Windows explorer."
  (interactive)
  (if (eq system-type 'windows-nt)
      (shell-command "explorer.exe")
    (error "This command can only be used on Windows.")))

(defun ry/launch-internet-explorer ()
  "Open Internet Explorer."
  (interactive)
  (if (eq system-type 'windows-nt)      
      (shell-command "C:/Progra~1/Intern~1/iexplore.exe https://www.bing.com")
    (error "This command can only be used on Windows.")))
#+end_src

* Packages
** Paradox
Being able to use Emacs while packages are updated is a fantastic thing.  Paradox 
makes this happen.  The async package should be brought in automatically but for
some reason it is here anyway.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package async
  :ensure t)

(use-package paradox
  :ensure t
  :commands (paradox-mode paradox-upgrade-packages)
  :config
  (progn
    (setq paradox-execute-asynchronously t)
    (setq paradox-github-token t)))
#+end_src

** Diminish
Diminish reduces the clutter from the mode-line.  Just as with the async package,
it really should be brought in as a dependency of another (use-package).

#+begin_src emacs-lisp :tangle yes :exports code
(use-package diminish
  :ensure t)
#+end_src

** Solarized color theme
This is the Solarized color theme that is common to VIM.  I change the mode-line
to have a different color and also change a couple faces for code block in 
org-mode so that they stand out more.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package solarized-theme
  :ensure t
  :config
  (progn
    (load-theme 'solarized-dark t)
    (set-face-attribute 'mode-line nil
                        :inverse-video t
                        :weight 'bold
                        :overline nil
                        :underline nil
                        :box nil
                        :foreground "#93a1a1"
                        :background "#073642")
    (set-face-attribute 'mode-line-inactive nil
                        :inverse-video t
                        :weight 'bold
                        :overline nil
                        :underline nil
                        :box nil
                        :foreground "#657b83"
                        :background "#073642")
    (with-eval-after-load 'org
      (set-face-attribute 'org-block-begin-line nil
                          :underline t
                          :background "#073642")
      (set-face-attribute 'org-block-end-line nil
                          :overline t
                          :background "#073642")
      (set-face-attribute 'org-block-background nil
                          :background "#073642"))))
#+end_src

** Rainbow Delimiters
Make delimiters a little easier to match up without having to be on one of them.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package rainbow-delimiters
  :ensure t 
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
#+end_src

** Smartscan
Smartscan mode allows for finding the next/previous occurrence of the symbol 
under point.  

#+begin_src emacs-lisp :tangle yes :exports code
(use-package smartscan
  :ensure t
  :commands (smartscan-symbol-go-forward smartscan-symbol-go-backward)
  :bind (("M-n" . smartscan-symbol-go-backward)
         ("M-p" . smartscan-symbol-go-backward))
  :config
  (add-hook 'prog-mode-hook 'smartscan-mode))
#+end_src

** NXML Mode
Use the fantastic NXML mode for XML editing.  Folding of a document based on the
current tag is bound to ==C-c h== but as much as I like the idea of folding I 
don't end up using it very much.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package nxml-mode
  :commands nxml-mode
  :config
  (progn
    (setq nxml-child-indent 2)
    (setq nxml-attribute-indent 4)
    (setq nxml-auto-insert-xml-declaration-flag nil)
    (setq nxml-slash-auto-complete-flag t)
    
    (require 'sgml-mode)
    (require 'nxml-mode)

    (use-package hideshow
      :ensure t
      :config
      (progn
        (add-to-list 'hs-special-modes-alist
                     '(nxml-mode
                       "<!--\\|<[^/>]*[^/]>"
                       "-->\\|</[^/>]*[^/]>"
                       "<!--"
                       sgml-skip-tag-forward
                       nil))

        (add-hook 'nxml-mode-hook 'hs-minor-mode))

      ;; optional key bindings, easier than hs defaults
      (define-key nxml-mode-map (kbd "C-c h") 'hs-toggle-hiding))))
#+end_src

** Web Mode
Enable web mode for various file extensions.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package web-mode
  :ensure t
  :mode 
  (("\\.phtml\\'" . web-mode)
   ("\\.tpl\\.php\\'" . web-mode)
   ("\\.jsp\\'" . web-mode)
   ("\\.as[cp]x\\'" . web-mode)
   ("\\.erb\\'" . web-mode)
   ("\\.mustache\\'" . web-mode)
   ("\\.djhtml\\'" . web-mode))
  :init
  (setq web-mode-enable-auto-pairing nil))
#+end_src

