emacs-config.org
** Helm
Use Helm everywhere.  I like the UI for Helm and the way that it allows for
narrowing search results.  The downside is that it is the single largest hit to
startup time in this config.  If I could get used to IDO after using Helm for
so long I would because of the startup time issue.  I'm not sure if other 
people have this issue or not as I was unable to find any similar problems when
doing a couple searches.  On an SSD the load time is fine but on my work 
machine which a HDD it is painful.

The configuration is pretty basic with the exception being mapping the tab
key to helm-execute-persistent-action.  This was done so that it behaves in a
similar way as bash.  Also I like to force Helm to always split the current 
window vertically.

#+begin_src emacs-lisp :tangle yes :exports code
  (use-package helm
    :ensure t
    :diminish helm-mode
    :bind (("C-M-s" . helm-occur)
           ("C-x C-f" . helm-find-files)
           ("M-x" . helm-M-x)
           ("C-x b" . ry/switch-buffer)
           ("C-x C-b" . helm-buffers-list)
           ("C-x r l" . helm-bookmarks)
           ("C-h f" . helm-apropos)
           ("C-h r" . helm-info-emacs)
           ("C-h C-l" . helm-locate-library)
           ("M-y" . helm-show-kill-ring)
           ("C-x C-b" . ry/switch-buffer)
           ("<f7>" . helm-bookmarks)
           ("<f8>" . bookmark-set))
    :config
    (progn
      (require 'helm-config)

      (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebihnd tab to do persistent action
      (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB works in terminal
      (define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z

      (setq helm-quick-update                     t
            helm-split-window-in-side-p           t
            helm-buffers-fuzzy-matching           t
            helm-ff-search-library-in-sexp        t
            helm-scroll-amount                    8
            helm-ff-file-name-history-use-recentf t
            helm-mini-default-sources '(helm-source-buffers-list
                                        helm-source-recentf
                                        helm-source-bookmarks
                                        helm-source-buffer-not-found))
      
      ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      ;;  Make helm always create a new window and always split the current window
      ;;  vertically.
      ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      (setq helm-display-function
            (lambda (buf)
              (split-window-vertically)
              (other-window 1)
              (switch-to-buffer buf)))

      (helm-mode)))
#+end_src

** Multiple Cursors
Enable the use of multiple cursors.  This is a fantastic package that gets a lot
of use in my work.  People think you are a wizard when they see you editing 
multiple lines/places at once.  Similar to macros but easier to visualize.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package multiple-cursors
  :ensure t
  :bind (("C-S-s C-S-s" . mc/edit-lines)
         ("C->" . mc/mark-next-symbol-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c *" . mc/mark-all-like-this)))
#+end_src

** Guru Mode
Disable arrow keys and force yourself to use the Emacs bindings for navigation.
I put this one when I first stared to use Emacs and it has stuck.  I now get 
annoyed in other applications when they do not behave as I want.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package guru-mode
  :ensure t
  :init
  (guru-mode))
#+end_src

** Expand Region
A very helpful package for expanding the current region by semantic units.  

#+begin_src emacs-lisp :tangle yes :exports code
(use-package expand-region
  :ensure t
  :bind (("C-=" . er/expand-region)))
#+end_src

** Eldoc Mode
Enable Eldoc for Lisp modes.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package "eldoc"  
  :diminish eldoc-mode
  :init
  (progn
    (setq eldoc-idle-delay 0.2)
    (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
    (add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
    (add-hook 'ielm-mode-hook 'turn-on-eldoc-mode)))
#+end_src

** Org-Mode
What is there to say.  Doesn't everyone who uses Emacs also use org-mode?  My
org-mode configuration is contained in another file but will eventually be 
merged into this one and documented.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package org
  :ensure t 
  ;:commands (org-agenda org-capture)
  :config
  (progn
    (eval-after-load "org-mode"
      (load "~/.emacs.d/custom-org-mode.el"))))
#+end_src

** Undo Tree
Visual way to unto changes.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package undo-tree
  :ensure t
  :diminish undo-tree-mode
  :bind (("C-x u" . undo-tree-visualize))
  :commands undo-tree-visualize
  :config
  (progn
    (global-undo-tree-mode)
    (setq undo-tree-visualizer-timestamps t)
    (setq undo-tree-visualizer-diff t)))
#+end_src

** God Mode
I am not a huge fan of VIM but I can admit that the modal editing is better 
for my hands.  I spent all this time getting used to the Emacs keybindings so
I am using god-mode instead of evil.

In addition to adding keybindings to help work with this mode I have added a 
hook to the post-command-hook to change the cursor.  The cursor will be a red
box when god-mode is enabled and a regular pipe otherwise.  This done to help
me remember which mode I am in.  At one time I had the mode-line change color
but I didn't care for the colors on Solarized when I changed from Monokai.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package god-mode
  :ensure t
  :bind (("<escape>" . god-local-mode)
         ("C-x C-1" . delete-other-windows)
         ("C-x C-2" . sacha/vsplit-last-buffer)
         ("C-x C-3" . sacha/hsplit-last-buffer)
         ("C-x C-0" . delete-window)
         ("C-x C-k" . kill-this-buffer)
         ("C-x C-S-k" . kill-other-buffers)
         ("C-x C-o" . other-window)
         ("C-c C-r" . org-capture)
         ("C-C C-a" . org-agenda)
         ("C-x C-h" . mark-whole-buffer)
         ("C-x C-d" . dired)
         ("C-x C-g" . magit-status)
         ("C-c C-g" . magit-status)
         ("C-c C-t" . hydra-toggle/body)
         ("C-c C-l" . hydra-launch/body))
  :init
  (progn
    (god-mode-all)
    
    (define-key god-local-mode-map (kbd "z") 'repeat)
    (define-key god-local-mode-map (kbd "i") 'god-local-mode)
    (define-key god-local-mode-map (kbd "v") 'scroll-up-command)
    (define-key god-local-mode-map (kbd "r") 'ry/replace-character-at-point)
    (define-key god-local-mode-map (kbd "DEL") 'delete-backward-char)
    
    (setq god-exempt-major-modes nil)
    (add-to-list 'god-exempt-major-modes 'dired-mode)
    (add-to-list 'god-exempt-major-modes 'org)
    (add-to-list 'god-exempt-major-modes 'eshell-mode)
    (add-to-list 'god-exempt-major-modes 'oeg-agenda)

    (require 'god-mode-isearch)
    (define-key isearch-mode-map (kbd "<escape>") 'god-mode-isearch-activate)
    (define-key god-mode-isearch-map (kbd "<escape>") 'god-mode-isearch-disable)

    ;;  When capturing notes I want to start with god mode disabled.  Adding org-mode
    ;;  to the god-exempt-major-modes list did not work for some reason.  Looking at
    ;;  the buffer name does.
    (defun ry/god-org-capture-p ()
      "Return non-nil if buffer is an org capture buffer."
      (string-equal (buffer-name) "CAPTURE-refile.org"))

    (setq god-exempt-predicates nil)
    (add-to-list 'god-exempt-predicates 'ry/god-org-capture-p)
    
    ;;  Change the color of the cursor to RED if god-mode is enabled.
    (add-hook 'post-command-hook
              (lambda ()
                (if (or god-local-mode buffer-read-only)
                    (progn                   
                      (set-cursor-color "#b22222")
                      (setq cursor-type 'box))
                  (progn
                    (set-cursor-color "#839496")
                    (setq cursor-type 'bar)))))))
#+end_src

** Golden Ratio
Use the golden ratio to size windows when multiples are open.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package golden-ratio
  :ensure t
  :diminish golden-ratio-mode
  :config
  (progn 
    (golden-ratio-mode)
    (setq golden-ratio-exclude-modes
          '("dired-mode"
            "ediff-mode"
            "eshell-mode"))))
#+end_src

