emacs-config.org
** Company Mode
Completion is done using Company mode.  I was originally using Auto Complete but
switched to Company.  I cannot remember the reason for the switch but the config
is gone now so I am here to stay unless there is some big reason to switch back.

The main modification is to use C-n and C-p to cycle through candidates and the
faces for the popup.  The faces are done using the color package so that it 
fits in with my theme.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package company
  :ensure t
  :diminish company-mode
  :config
  (progn
    (use-package company-quickhelp
      :ensure t
      :config
      (progn
        (company-quickhelp-mode 1)
        (setq company-quickhelp-delay 0.1)))
    (global-company-mode)
    (setq company-idle-delay 0.5)
    (setq company-show-numbers t)
    (setq company-selection-wrap-around t)
    (setq company-tooltip-limit 10)
    (setq company-tooltip-flip-when-above t)
    (setq company-dabbrev-downcase nil)
    (setq company-dabbrev-ignore-invisible t)
    (setq company-dabbrev-ignore-buffers "\\`[ ]'")
    (setq company-dabbrev-code-ignore-case t)
    (setq company-dabbrev-code-other-buffers 'all)
    (setq company-dabbrev-other-buffers 'all)

    (add-to-list 'load-path "~/.emacs.d/extra")
    (require 'ry-company-sql)    
    (add-to-list 'company-backends 'ry/company-sql)


    (with-eval-after-load 'company
      (define-key company-active-map (kbd "M-n") nil)
      (define-key company-active-map (kbd "M-p") nil)
      (define-key company-active-map (kbd "C-n") #'company-select-next)
      (define-key company-active-map (kbd "C-p") #'company-select-previous))

    (require 'color)
    (let ((bg (face-attribute 'default :background)))
      (set-face-attribute 'company-tooltip nil
                          :inherit 'default
                          :background (color-lighten-name bg 2))
      (set-face-attribute 'company-scrollbar-bg nil
                          :background (color-lighten-name bg 10))
      (set-face-attribute 'company-scrollbar-fg nil
                          :background (color-lighten-name bg 5))
      (set-face-attribute 'company-tooltip-selection nil
                          :inherit font-lock-function-name-face)
      (set-face-attribute 'company-tooltip-common nil
                          :inherit font-lock-constant-face))))
#+end_src

** Smartparens
This Smartparens configuration was taken from https://github.com/mwfogleman/config/blob/master/home/.emacs.d/michael.org
and http://pages.sachachua.com/.emacs.d/Sacha.html.
I am still trying to incorporate the package into my workflow.  It seems that 
it will be a very powerful addition to my work.  Strict mode was removed as I
am not at a point where I am able to work with it as well as I would like.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package smartparens
  :ensure t
  :diminish smartparens-mode
  :bind
  (("C-M-f" . sp-forward-sexp)
   ("C-M-b" . sp-backward-sexp)
   ("C-M-d" . sp-down-sexp)
   ("C-M-a" . sp-backward-down-sexp)
   ("C-S-a" . sp-beginning-of-sexp)
   ("C-S-d" . sp-end-of-sexp)
   ("C-M-e" . sp-up-sexp)
   ("C-M-u" . sp-backward-up-sexp)
   ("C-M-t" . sp-transpose-sexp)
   ("C-M-n" . sp-next-sexp)
   ("C-M-p" . sp-previous-sexp)
   ("C-M-k" . sp-kill-sexp)
   ("C-M-w" . sp-copy-sexp)
   ("M-<delete>" . sp-unwrap-sexp)
   ("M-S-<backspace>" . sp-backward-unwrap-sexp)
   ("C-<right>" . sp-forward-slurp-sexp)
   ("C-<left>" . sp-forward-barf-sexp)
   ("C-M-<left>" . sp-backward-slurp-sexp)
   ("C-M-<right>" . sp-backward-barf-sexp)
   ("M-D" . sp-splice-sexp)
   ("C-M-<delete>" . sp-splice-sexp-killing-forward)
   ("C-M-<backspace>" . sp-splice-sexp-killing-backward)
   ("C-M-S-<backspace>" . sp-splice-sexp-killing-around)
   ("C-]" . sp-select-next-thing-exchange)
   ("C-<left_bracket>" . sp-select-previous-thing)
   ("C-M-]" . sp-select-next-thing)
   ("M-F" . sp-forward-symbol)
   ("M-B" . sp-backward-symbol)
   ("H-t" . sp-prefix-tag-object)
   ("H-p" . sp-prefix-pair-object)
   ("H-s c" . sp-convolute-sexp)
   ("H-s a" . sp-absorb-sexp)
   ("H-s e" . sp-emit-sexp)
   ("H-s p" . sp-add-to-previous-sexp)
   ("H-s n" . sp-add-to-next-sexp)
   ("H-s j" . sp-join-sexp)
   ("H-s s" . sp-split-sexp)
   ("M-9" . sp-backward-sexp)
   ("M-0" . sp-forward-sexp))
  :init
  (progn
    (smartparens-global-mode t)
    ;; (smartparens-strict-mode t)
    (show-smartparens-global-mode t)
    (use-package smartparens-config)

    (sp-local-pair 'web-mode "<" nil :when '(sacha/sp-web-mode-is-code-context))
  
    (sp-with-modes '(html-mode sgml-mode web-mode)
                   (sp-local-pair "<" ">"))))
#+end_src

** Dired+
I like to see line highlighting for every other row when looking at directory
listings.  

#+begin_src emacs-lisp :tangle yes :exports code
(use-package dired+
  :ensure t
  :commands dired
  :config
  (progn
    (toggle-diredp-find-file-reuse-dir 1)
    (add-to-list 'load-path "~/.emacs.d/extra")
    (require 'dired-sort-menu)
    (setq dired-hide-details-mode nil)))
#+end_src

** Magit
The only reason I use git is to save this configuration, but I can see how this
mode could be very useful.  Perhaps someday work will make the switch.  This
configuration was taken from https://github.com/mwfogleman/config/blob/master/home/.emacs.d/michael.org.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package magit
  :ensure t
  :bind (("C-x g" . magit-status)
         ("C-c g" . magit-status))
  :config
  (use-package git-timemachine
    :ensure t
    :bind (("C-x v t" . git-timemachine)))
  (use-package git-link
    :ensure t
    :bind (("C-x v L" . git-link))
    :init
    (setq git-link-open-in-browser t))
  (setq magit-use-overlays nil)
  ;; (diminish 'magit-auto-revert-mode)
  ;; (diminish 'magit-backup-mode)
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it
    (delete-other-windows))

  (defun magit-quit-session ()
    "Restores the previous window configuration and kills the magit buffer"
    (interactive)
    (kill-buffer)
    (jump-to-register :magit-fullscreen))

  (setq magit-last-seen-setup-instructions "1.4.0")

  (bind-keys :map magit-status-mode-map
             ("TAB" . magit-section-toggle)
             ("<C-tab>" . magit-section-cycle)
             ("q" . magit-quit-session)))
#+end_src

** Lineum Relative
I don't typically have need to show line numbers but when I do it is helpful to
see the relative line numbers instead of only the absolute.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package linum-relative
  :ensure t
  :commands linum-mode
  :config
  (progn
    (setq linum-format 'linum-relative)
    (setq linum-relative-current-symbol "")))
#+end_src

** Comment DWIM 2
Commenting should be DWIM.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package comment-dwim-2
  :ensure t
  :bind (("M-;" . comment-dwim-2)))
#+end_src

** Mediawiki
For editing the MediaWiki at work.  An old version of Mediawiki is being   
used which is incompatible so this is only being used for the little code  
coloring that it provides.  As such the keybinding for C-x C-s that is 
provided by the mode is overwritten by the default action.             

#+begin_src emacs-lisp :tangle yes :exports code
(use-package mediawiki
  :ensure t
  :commands mediawiki-mode
  :config
  (eval-after-load 'mediawiki
    (define-key mediawiki-mode-map (kbd "C-x C-s") 'save-buffer)))
#+end_src

** Stripe Buffer
Stripe dired buggers and org-mode tables for easier reading.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package stripe-buffer
  :ensure t
  :defer t
  :config
  (progn
    (add-hook 'dired-mode-hook 'stripe-listify-buffer)
    (add-hook 'org-mode-hook 'turn-on-stripe-table-mode)
    (setq stripe-hl-line "#073642")
    (set-face-attribute stripe-highlight-face nil :background "#073642")))
#+end_src

** Avy Jump
Avy jump looks like it could be helpful.  The configuration needs to be updated
to include keybindings.  I originaly also had key chord mixed in here but decided
that it was not going to get any use.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package avy
  :ensure t
  :bind (("C-c SPC" . avy-goto-char)))
#+end_src

** JSON Reformat
Work requires me to work with JSON objects every blue moon.  Being able to 
pretty print them is a good thing.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package json-reformat
  :ensure t
  :commands (json-pretty-print json-pretty-print-buffer))
#+end_src

** Git Gutter+
Add Git diff information to the gutter so that I can easily track changes.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package git-gutter+
  :ensure t
  :commands git-gutter+-mode
  :diminish git-gutter+-mode
  :config
  (progn
    (setq git-gutter+-modified-sign "  ") ;; two space
    (setq git-gutter+-added-sign "++")    ;; multiple character is OK
    (setq git-gutter+-deleted-sign "--")
    (set-face-background 'git-gutter+-modified "#073642")))
#+end_src

