emacs-config.org
** Hydra
Hyrda is a very cool package.  Prior to hydra I was using custom maps for a 
couple small groups of related commands.  The original configuration was similar
to the one here, https://github.com/mwfogleman/config/blob/master/home/.emacs.d/michael.org.  
Hydra has taken over this duty and I have a couple more uses in mind as well.

Whitespace mode was marked as required so that the mode toggle hydra would
work correctly.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package hydra
  :ensure t
  :commands (hydra-toggle/body hydra-launch/body hydra-xml/body)
  :bind (("C-c t" . hydra-toggle/body)
         ("C-c l" . hydra-launch/body)
         ("C-c x" . hydra-xml/body))
  :config
  (progn
    (require 'whitespace)
    
    ;;  Change the blue face color as it is hard to see in Solarized dark.
    (set-face-attribute 'hydra-face-blue nil
                        :foreground "#4169e1")
    
    (defhydra hydra-toggle (:color pink)
      "
_a_bbrev-mode:         %`abbrev-mode
_m_enu-bar-mode:       %`menu-bar-mode
_d_ebug-on-error:      %`debug-on-error
_f_lyspell-mode:       %`flyspell-mode
_g_lobal-hl-line-mode: %`global-hl-line-mode
_w_hitepace-mode:      %`whitespace-mode
_s_martparens-mode:    %`smartparens-mode

"
      ("a" abbrev-mode nil)
      ("m" menu-bar-mode nil)
      ("d" toggle-debug-on-error nil)
      ("f" flyspell-mode nil)
      ("g" global-hl-line-mode nil)
      ("s" smartparens-mode nil)
      ("w" whitespace-mode nil)
      ("q" nil "cancel"))

    (defhydra hydra-launch (:color blue)
      "
_i_nternet Explorer
_w_indows Explorer

"
      ("i" ry/launch-internet-explorer nil)
      ("w" ry/launch-windows-explorer nil)
      ("q" nil "cancel" :color red))

    (defhydra hydra-xml (:color blue)
      "
_f_ormat
_l_inearlize
_w_here
_x_query buffer
Xquery _r_egion

"
      ("f" ry/xml-format nil)
      ("l" ry/xml-linearlize nil)
      ("w" ry/xml-where nil)
      ("x" ry/xquery nil)
      ("r" ry/xquery-with-region nil)
      ("q" nil "cancel" :color red))

    (defhydra hydra-clock (:color blue)
      "
Clock _i_n
Clock _o_ut
Clock _g_oto
"
      ("i" org-clock-in nil)
      ("o" org-clock-out nil)
      ("g" org-clock-goto nil))

    (global-set-key (kbd "C-c t") 'hydra-toggle/body)
    (global-set-key (kbd "C-c l") 'hydra-launch/body)
    (global-set-key (kbd "C-c x") 'hydra-xml/body)
    (global-set-key (kbd "<f9>") 'hydra-clock/body)))

#+end_src

** Recentf
Save the recent file history.  This is used by Helm.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package recentf
  :ensure t
  :commands (helm-mini)
  :init
  (progn
    (recentf-mode)
    (setq recentf-max-saved-items 25)
    (setq recentf-auto-cleanup 'never)
    (add-to-list 'recentf-exclude "COMMIT_EDITMSG\\'")))
#+end_src

** Eww Lnum
Add numbers to links in web pages when using Eww the same way that Surf or other
minimal web browsers do.  I don't use eww very often but it is helpful when I do.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package eww-lnum
  :ensure t
  :commands eww
  :init
  (eval-after-load "eww"
    '(progn (define-key eww-mode-map "f" 'eww-lnum-follow)
            (define-key eww-mode-map "F" 'eww-lnum-universal))))
#+end_src

** Stackexchange
Everyone uses Stackexchange.  Why not interact with it through Emacs.

#+begin_src emacs-lisp :tangle yes :exports code 
(use-package sx
  :ensure t
  :commands (sx-tab-feature sx-tab-frontpage sx-tab-hot sx-tab-newest sx-tab))
#+end_src

** Whole Line or Region
This package makes commands work differently based on if a region is selected
or not.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package whole-line-or-region
  :ensure t
  :config
  (whole-line-or-region-mode))
#+end_src

** Fold This
A folding package based on the active region.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package fold-this
  :ensure t
  :bind (("C-c C-f" . fold-this-all)
         ("C-c C-F" . fold-this)
         ("C-c M-f" . fold-this-unfold-all)))
#+end_src

** Anzu 
Anzu is a visual regular expression/replace package.  It includes some nice
highlighting ability while doing replaces or searches.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package anzu
  :ensure t
  :diminish anzu-mode
  :bind (("C-M-s" . anzu-query-replace)
         ("C-M-%" . anzu-query-replace-regexp)))
#+end_src

** Re-builder
Visual regular expression building.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package re-builder
  :ensure t
  :commands (re-builder)
  :config
  (setq reb-re-syntax 'string))
#+end_src

** Change Inner
Call the change--inner and then the starting character to modify the inside
portion of the group.  Not sure if this will get use.  One of those things
that could save a lot of time but there is a need to change a deep habit.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package change-inner
  :ensure t
  :bind (("M-i" . change-inner)
         ("M-o" . change-outer)))
#+end_src

** Fill Column Indicator
I like to know where column 80 is.  This used to be a big deal years ago and is
not so much an issue now but I sill like to know where it is in the rare event
that I need to print a listing.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package fill-column-indicator
  :ensure t
  :commands (fci-mode)
  :config
  (progn    
    (defun sanityinc/fci-enabled-p () (symbol-value 'fci-mode))
    
    (defvar sanityinc/fci-mode-suppressed nil)
    (make-variable-buffer-local 'sanityinc/fci-mode-suppressed)
    
    (defadvice popup-create (before suppress-fci-mode activate)
      "Suspend fci-mode while popups are visible"
      (let ((fci-enabled (sanityinc/fci-enabled-p)))
        (when fci-enabled
          (setq sanityinc/fci-mode-suppressed fci-enabled)
          (turn-off-fci-mode))))
    
    (defadvice popup-delete (after restore-fci-mode activate)
      "Restore fci-mode when all popups have closed"
      (when (and sanityinc/fci-mode-suppressed
                 (null popup-instances))
        (setq sanityinc/fci-mode-suppressed nil)
        (turn-on-fci-mode)))

    (setq fci-rule-column 80)
    (fci-mode)))
#+end_src

** Swiper
Searching similar to helm swoop.  Swoop was slow in some situations.  Need to 
evaluate if swiper is faster and if I really have a need for the ability that 
the package provides.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package swiper-helm
  :ensure t
  :commands (swiper-helm))
#+end_src

** Sr-Speedbar
Speedbar.  It seems like such a nice thing to have and yet I rarely ever use it.
When in Eclipse I use it all the time but the need is not really there when using
Emacs.  May be I will enable it again at some point in time.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package sr-speedbar
  :ensure t
  :commands (sr-speedbar-toggle)
  :disabled t
  :config
  (progn
    (setq sr-speedbar-skip-other-window-p nil)
    (setq speedbar-use-images nil)
    (setq sr-speedbar-right-side t)))
#+end_src

** Popwin
Fix annoying buffer popups.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package popwin
  :ensure t
  :config
  (popwin-mode))
#+end_src

** Flycheck
On-the-fly syntax checking.  I included this when I added Eclim.  Not sure if it
is really needed as the syntax highlighing is not working.  Maybe I will look 
in to it.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package flycheck
  :ensure t
  :disabled t
  :config
  (add-hook 'after-init-hook #'global-flycheck-mode))
#+end_src

** Lisp Mode
Lisp mode hooks for cask files for if/when I start looking in to
cask.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package lisp-mode
  :mode ("Cask\\'" . emacs-lisp-mode)
  :config
  (progn
    (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
    (add-hook 'emacs-lisp-mode-hook 'smartparens-strict-mode)))
#+end_src

** Highlight Symbol
Not sure if this package will stay around either.  It is used for highlighting 
the sysmbol at point.  Highlights a lot if it is enabled in a buffer that has a
lot of the same word.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package highlight-symbol
  :ensure t
  :config
  (progn
    (add-hook 'prog-mode-hook 'highlight-symbol-mode)
    (setf highlight-symbol-idle-delay 0)))
#+end_src

** Discover My Major
Helps to discover keybindings for the current mode.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package discover-my-major
  :ensure t
  :commands discover-my-major)
#+end_src

** Move Text
Text manipulation helpers.  Need to do some more research on this.  Cannot 
remember why I added this package.  Could be for the transpose command.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package move-text
  :ensure t)
#+end_src

** CIDER
I do not write Clojure code but I would like to learn when time permits.

#+begin_src emacs-lisp :tangle yes :exports code
(use-package cider
  :ensure t
  :bind (("<f10>" . cider-jack-in))
  :config
  (progn
    (add-hook 'cider-mode-hook #'eldoc-mode)
    (setq nrepl-hide-special-buffers t)
    (setq cider-repl-tab-command #'indent-for-tab-command)
    (add-hook 'cider-repl-mode-hook #'subword-mode)))
#+end_src

