emacs-config.org
** Eclim
And then there is emacs-eclim.  This took a lot of experimentation to get working.
Eventhough it is working the way that it is working is not the best.  There are a 
number of comments in the code that detail why things were done the way there 
were.  

I wonder if the issue for the problems is that I am running an old 
version of Eclipse or the fact that the machine that I do my Java work is a 
Windows one.  I would have to imagine it is a little of both.

The changes that were made to get it working are not pretty.  
#+begin_src emacs-lisp :tangle yes :exports code
(use-package emacs-eclim
  :ensure t
  :config
  (progn
    (require 'eclim-problems)
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  Use the company backend that comes with eclim instead.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (require 'company-emacs-eclim)
    (company-emacs-eclim-setup)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  Windows setup so that eclim knows where the bat file is.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (custom-set-variables
     '(eclim-eclipse-dirs '("C:/IBM/SDP"))
     '(eclim-executable "C:/IBM/SDP/p2/cic.p2.cache.location/plugins/org.eclim_1.7.14/bin/eclim.bat")
     '(company-eclim-executable "C:/IBM/SDP/p2/cic.p2.cache.location/plugins/org.eclim_1.7.14/bin/eclim.bat"))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  Toggle debugging.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (eclim-toggle-print-debug-messages)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  Again, a windows modification so that the eclim bat can be found for my
    ;;  particular work setup.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (defun eclim-executable-find ()
      (let (file)
        (dolist (eclipse-root eclim-eclipse-dirs)
          (and (file-exists-p
                (setq file (expand-file-name "plugins" eclipse-root)))
               (setq file (car (last (directory-files file t "^org.eclim_"))))
               (file-exists-p (setq file (expand-file-name "bin/eclim" file)))
               (return (expand-file-name "eclim.bat" eclipse-root))))))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  Same as above.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (defun company-eclim-executable-find ()
      (let (file)
        (cl-dolist (eclipse-root '("c:/IBM/SDP"))
          (and (file-exists-p (setq file (expand-file-name "plugins" eclipse-root)))
               (setq file (car (last (directory-files file t "^org.eclim_"))))
               (file-exists-p (setq file (expand-file-name "bin/eclim" file)))
               (cl-return (expand-file-name "eclim.bat" eclipse-root))))))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  This is a built in function that I have duplicated for emacs-eclim use.
    ;;  emacs-eclim will fail on windows when executing the eclim.bat fome the 
    ;;  current directory on the F:/.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (defun ry/shell-command-to-string (command)
      "Execute shell command COMMAND and return its output as a string
using C:/ as the default directory."
      (setq default-directory "C:/")
      (with-output-to-string
        (with-current-buffer
          standard-output
          (process-file shell-file-name nil t nil shell-command-switch command))))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;  This is the same issue that lead to the above function being created.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    (defun eclim--call-process (&rest args)
      "Calls eclim with the supplied arguments. Consider using
`eclim/execute-command' instead, as it has argument expansion,
error checking, and some other niceties.."
      (let ((cmd (eclim--make-command args)))
        (setq cmd2 (replace-regexp-in-string "\\\\" "" (format "%s" cmd)))
        (when eclim-print-debug-messages (message "Executing: %s" cmd2))
        (eclim--parse-result (ry/shell-command-to-string cmd))))

    ;; Clobber this keybinding for eclim use.
    (define-key eclim-mode-map (kbd "M-/") 'company-emacs-eclim)
    (define-key eclim-mode-map (kbd "M-.") 'eclim-java-find-declaration)))
#+end_src

#+begin_src emacs-lisp :tangle yes :exports code
(provide 'emacs-config)
;;; emacs-config.el ends here
#+end_src

